#+title: Sequences
#+author: Erik An
#+email: obluda2173@gmail.com
#+date: <2025-11-19>
#+lastmod: <2025-11-20 18:30>
#+options: num:t
#+startup: overview

* Sequences
** Original
*** Page 1
A sequnce (an) or (an)[∞,n=1] is a collection
        a1, a2, a3, ...

where the order is important

        1, 1/2, 1/3, 1/4, ...

        (-1)^n

        x1 = 1, x[n+1] = (x[n] + 1)/(2)         (recursive formula)

Def. A sequence is a f-n whose domain is ℕ.
f(n) = an

We always consider real sequence
(a[n]) ⊂ ℝ.

Def. A sequence (a[n]) is (∀n)
1. Increasing : a[n] <= a[n+1]
2. Decreasing : a[n] >= a[n+1]
3. Strictly increasing: a[n] < a[n+1]
4. Strictly decreasing: a[n] > a[n+1]
5. Monotone : a[n] is increasing or decreasing
6. Striclty monotone : a[n] is strictly increasing or strictly decreasing.
7. Bounded above : ∃M : a[n] <= M
                        ∀n
8. Bounded below : ∃M : a[n] >= M
                        ∀n
9. Bounded : ∃M : |a[n]| <= M
                   ∀n

Def. A sequence (a[n]) converges to a∈ℝ if ∀e > 0, ∃N∈ℕ, ∀n>=N, |a[n] - a| < e
*** Page 2
Def. Let ε (epsilon) > 0, a ∈ ℝ. An epsilon-neiborhood of a is the set ∪ε(a) = {x ∈ ℝ : |x-a| < ε"}.

Alternative def. of convergence.
A sequence (a_n) converges to a if every epsilon-neiborhood of a (ε>0) contains all but infinite number of elements of (a_n).

Notation: a_n --> a (as n->∞)
        lim(n->∞)(a_n = a)      (a is limit of a_n)

Def. If (a_n) does not converge to any a∈ℝ, then it is divergent.

a_n !-> a : (a_n) does not converge to a :

∃ε > 0  ∀N∈ℕ ∃n>=N:
        |a_n-a| >= ε

We play the game:
- You want to show a_n -> a.
- I want to show a_n !->a.

- I give you ε-neighborhood
- You give me N
- We both check whether
  a_n, a_n+1, a_n+2, ... are in this ε-neighborhood

*** Page 3
Example.
1. lim(n->∞)(1/n) = 0

   Solution. We must show

   ∀ε>0 ∃N∈ℕ ∀n>=N |1/n - 0| < ε <--> 1/n < ε <--> n > 1/ε
   N>1/ε --> n>=N>1/ε


   Let ε>0. Let N>1/ε. Then

   ∀n>=N  |1/n - 0| < ε
   <--> n > 1/ε

   ε = 10^-6 if N > 1/10^-6 = 10^6

2. lim(n->∞)(n/(n+2)) = 1

   Solution
   (Game): We must prove:
   ∀ε>0 ∃N∈ℕ ∀n>=N |n/(n+2) - 1| < ε
   <--> 2/(n+2) < ε
   <--> n+2 > 2/ε <--> n > 2/ε - 2


   Let ε>0. Let N>(2/ε - 2). Then

   ∀n>=N
   |n/(n+2) - 1 | = 2/(n+2) <= 2/(N+2)

   <ε
*** Page 4
Skip, as its just examples that I already got and wrote.

*** Page 5
:LOGBOOK:
CLOCK: [2025-11-20 Thu 17:25]--[2025-11-20 Thu 17:50] =>  0:25
:END:
*Thm.* If a sequence (a_n) converges, then its limit is unique.

*Proof.* Suppose a_n -> a
         and a_n -> b, and a != b.

∀ε>0 ∃N_1∈ℕ : ∀n>=N_1 |a_n - a| < ε
∀ε>0 ∃N_2∈ℕ : ∀n>=N_2 |a_n - b| < ε

∀n >= max{N1, N2}
      |a_n-a| < ε
      |a_n-b| < ε

By triangle inequality
2ε > |a_n - a| + |a_n - b| >= |a_n - a - (a_n - b)| = |a - b|
ε >= |a-b|/2 - contradiction to a being arbitrary.


*Remember:* |x| + |y| >= |x+y| and |x| + |y| >= |x-y|

*Thm.* Every convergent sequence is bounded.

*Proof.*
[drawing of line with points on a_1, a_n, a-ε, a, a+ε, a_3, a_4]

Take ε>0. Since a_n -> a --> ∃N ∀n>=N |a_n - a| < ε.

∀n>= N
-ε < a_n - a < ε
<--> a - ε < a_n < a + ε
a_1, a_2, ..., a_N-1

M = max{|a_1|, |a_2|, ..., |a_N-1|, |a+ε|, |a-ε|}

Then |a_n| <= M ∀n



** Reviewed
:LOGBOOK:
CLOCK: [2025-11-20 Thu 16:52]--[2025-11-20 Thu 17:17] =>  0:25
CLOCK: [2025-11-20 Thu 16:18]--[2025-11-20 Thu 16:43] =>  0:25
CLOCK: [2025-11-20 Thu 14:46]--[2025-11-20 Thu 15:11] =>  0:25
:END:
1. Sequence: a sequence, denoted as (an) or (an) from n=1 to ∞, is an ordered collection of numbers a1, a2, a3, and so on.

   The order of these numbers matter. As for example, given the sequence 1, 1/2, 1/3, 1/4, ..., each item is smaller than the previous one. Another example is (-1)^n, where the sequence oscillates between -1 and 1.

   A sequence can also be defined recursively, as in the example x1=1, x[n+1] = (x[n] + 1)/2. In this case, the value of each term depends on the value of the previous number.

2. Definition: Functionally, a sequence could be seen as a function whose domain is ℕ, and range is usually ℝ.

   In this function f(n) = an, the nth term of the sequence is the result of the function f at n.

3. Types of sequences:
   - *Increasing* : If each term in the sequence is less or equal to next number.
     a[n] <= a[n+1]

   - *Decreasing* : If each term in the sequence is greater or equal to next number.
     a[n] <= a[n+1]

   - *Strictly increasing* : If each term in the sequence is less than next number.
     a[n] < a[n+1]

   - *Striclty decreasing* : If each term in the sequence is greater than next number.
     a[n] > a[n+1]

   - *Monotone* : If the sequence is either increasing or decreasing.

   - *Strictly monotone* : If the sequence is either strictly increasing or striclty decreasing.

   - *Bounded above* : If there exists M∈ℝ such that,

     a[n] <= M for all n.

     This means that the sequence never exceeds a certain value.

   - *Bounded below* : If there exists M∈ℝ such that,

     a[n] >= M for all n.

     This means that sequence never goes below a certain value.

   - *Bounded* : If there exists a real number (M), so that the absolute value of each term in the sequence is less than or equal to M, i.e.,

     |a[n]| <= M for all n.

     This means the sequence neither increases nor decreases beyond a certain magnitude.

4. Convergence of a sequence: a sequence is said to converge to a limit L as n approaches infinity if, for every positive number ε (epsilon) there exists a positive integer N such that for all terms a_n for n > N, the absolute difference between a_n and L is less then ε (epsilon). Essentially, this means the terms of the sequence get arbitrary close to L as you go further along in the sequence.

5. Epsilon neighbourhood: Imagine an ε (epsilon) a positive number, and real number a∈ℝ. We say that an epsilon neighborhood of a is the set of all real numbers, x, for which the absolute difference between the x and a is less than epsilon. In notation it looks:

        ∪ε(a) = {x ∈ ℝ : |x-a| < ε}

   Another alternative definition of convergence for sequences is: a sequence denoted as (a_n), converges to 'a' if, given any epsilon-neighborhood of 'a', all but a finite number of elements of the sequence reside within this epsilon neighborhood.

   We denote the convergence of a sequence (a_n) to 'a' as

        (a_n) --> a,

   as n tends to ∞. In terms of limits we can write this as lim(n->∞)(a_n = a), indicating that 'a' is the limit of the sequence (a_n).

   On the other hand, if a sequence does not converge to any real number 'a', we call it divergent. And formally, we say that the sequence (a_n) does not converge to 'a' : a_n !-> a, if and only if there exists some ε > 0 such that for all natural numbers N, there exists a number n greater than or equal to N where the absolute difference |a_n - a| is greater than or equal to ε.

        ∃ε>0 ∀N∈ℕ ∃n>=N : |a_n - a| >= ε

6. Practice:
   - lim(n->∞)(1/n) = 0

     Show: ∀ε>0 ∃N∈ℕ ∀n>=N : |1/n - 0| < ε.

     Which translates to: For all epsilons that are greater than 0, there exists a natural number N, for which all n numbers greater than N, such that the absolute difference between 1/n - 0 would be less than epsilon. In super simple words, show that there are infinite amount of numbers, such that 1/n would be less than another very small number.

     *Proof.*
     Let ε>0. Choose N∈ℕ such that 1/N < ε <--> N > 1/ε.
     Thus, ∀n>=N, 1/n <= 1/N < ε  <--> 1/n < ε.

   - lim(n->∞)(n/(n+2)) = 1

     Show: ∀ε>0 ∃N∈ℕ ∀n>=n : |n/(n+2) - 1| < ε.

     *Proof.*

     Simplify: n/(n+2) - 1

        n/(n+2) - 1 = n/(n+2) - (n+2)/(n+2)
                    = 2/(n+2)

     Hence, |n/(n+2) - 1| < ε <--> |2/(n+2)| < ε.

     Let ε>0. Choose N∈ℕ such that (2/(N+2)) < ε <--> N > 2/ε - 2.

     Thus, ∀n>=N 2/(n+2) <= 2/(N+2) < ε.
           ∀n>=N 2/(n+2) < ε.

     This proves lim(n->∞)(n/(n+2)) = 1.

   - lim(n->∞)((2n^2 + 3)/(n^2 + n + 1)) = 2

     Show: ∀ε>0 ∃N∈ℕ ∀n>=N : |(2n^2 + 3)/(n^2 + n + 1) - 2| < ε.

     *Proof.*

     Simplify: |(2n^2 + 3)/(n^2 + n + 1) - 2| <--> |((2n^2 + 3) - 2(n^2 + n + 1))/(n^2 + n + 1)|
                                              <--> |(-2n + 1)/(n^2 + n + 1)|
                                              <--> |(-2n + 1)/(n^2 + n + 1)|

     Notice: |-2n + 1| <= 2n + 1 < 2n + n (for n >= 1).

     Hence, |(-2n + 1)/(n^2 + n + 1)| <= 3n/(n^2 + n + 1) < 3n/n^2 = 3/n.

     Let ε>0. Choose N∈ℕ such that 3/N < ε.

     Thus, ∀n>=N 3/n <= 3/N < ε.

     Therefore, lim(n->∞)((2n^2 + 3)/(n^2 + n + 1)) = 2 is proved.

   - Show that (-1)^n is divirgent.

     Solution:

     Suppose (-1)^n -> a. Then

     ∀ε>0 ∃N∈ℕ ∀n>=N : |(-1)^n - a| < ε

     - If n >= N is odd, then |-1 - a| = |1 + a| < ε.

     - If n >= N is even, then |1 - a| < ε.

     Hence, |1 + a| + |1 - a| < 2ε
     --> 2ε > |1 + a| + |1 - a| >= |1 + a + 1 - a| = 2

     Contradiction if ε = 1/2.

     Therefore, (-1)^n is divergent.

7. Uniqueness of sequence limits:

   *Theorem.* If a sequence {a_n} converges, then its limit is unique.

   Lets prove it. Suppose for contradiction that a_n converges to two distrinct limits, a and b.

        a_n -> a, a_n -> b, and a != b

   For every positive ε, by the definition of convergence, there exist natural numbers N_1 and N_2 such that for all n greater than N_1 or N_2, the distance between a_n and a, would be less than ε. Hence, consider any n which is greater than or equal to the maximum of N_1 and N_2.

        ∀ε>0 ∃N_1∈ℕ : ∀n>=N_1 |a_n - a| < ε
        ∀ε>0 ∃N_2∈ℕ : ∀n>=N_2 |a_n - b| < ε

        ∀n >= max{N1, N2}
              |a_n-a| < ε
              |a_n-b| < ε

   For this n, we have |a_n - a| < ε and |a_n - b| < ε. However, by the triangle inequality, we have |a_n - a| + |a_n - b| >= |a - b|. Thus, 2ε > |a - b|, resulting in ε > |a - b|/2, which contradicts our assumption that a and b are distinct.

   - [ ] TODO tomorrow. Don't really see the point in it. Have a look on the general explanation of Uniqueness of limit, seems like Yuriy wrote some bullshit.
